## **BASIC SQL**
SQL (Standard Query Language) is a standard language for storing, manipulating, and retrieving data in databases. Contrasting Python, SQL is not a case-sensitive language so both of lower and upper case are the same meaning. However, usually to differentiate the command to others, we used UPPERCASE to write the commands. SQL commands list diagram is shown below:
![diagram](https://media.geeksforgeeks.org/wp-content/cdn-uploads/20190826175059/Types-of-SQL-Commands.jpg)

However, in this lesson, we are going to learn 5 basic commands of SQL only which are **CREATE**,**INSERT**,**UPDATE**, **DELETE**, and **SELECT**. Futhermore, we will focus on the querying commands which is **SELECT** and its several derivatives.

### **CREATE**
**CREATE** command used for creating a table or database. In general, the **CREATE** syntax are:
```mysql
-- create new database
CREATE DATABASE database_name;

-- to select database you want to query, run this command
USE database_name;

-- create new table
CREATE TABLE TABLENAME(
    COLUMN1 datatype,
    COLUMN2 datatype,
    ...
    );
```

**For example:**
```mysql
CREATE TABLE teachers (
    id INT PRIMARY KEY ,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date varchar(20),
    salary numeric
    );
```

You will have a table named teachers with empty columns like this:

|id|first_name|last_name|school|hire_date|salary|
|---|---|---|---|---|---|

To make the id or Primary key is auto incremental which means it's automatically filled based on the row order, you can add keyword AUTO_INCREMENT after keyword PRIMARY KEY just like this:

```mysql
CREATE TABLE teachers (
    id INT PRIMARY KEY AUTO_INCREMENT,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date varchar(20),
    salary numeric
    );
```

However, SQLite uses `id INTEGER KEY AUTOINCREMENT` to make the primary key is auto incremental. Futhermore, it is slightly different in PostgreSQL. the keyword SERIAL is used to create columns that increment automatically. For example `id SERIAL PRIMARY KEY`.

There is another way to define a primary key, for example:

```mysql
CREATE TABLE teachers (
    id INT,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date varchar(20),
    salary numeric,
    PRIMARY KEY (id)
    );
```

Also, you can define a foreign key with similar way:

```mysql
CREATE TABLE teachers (
    id INT,
    school_id INT,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date varchar(20),
    salary numeric,
    PRIMARY KEY (id)
    FOREIGN KEY(school_id) REFERENCES School(school_id)
    );
```

'School' after keyword REFERENCES is a another table that have connection with the table.

### **INSERT**
**INSERT** command used for adding value(s)/row(s) into a table. In general, the **INSERT** syntax are:
```mysql
INSERT INTO Table_Name (colomn1,colomn2,...) VALUES (value1,value2,...);
```

**For example:**
```mysql
INSERT INTO teachers (id,first_name, last_name, school, hire_date, salary)
    VALUES (1,'Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),
           (2,'Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
           (3,'Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),
           (4,'Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),
           (5,'Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),
           (6,'Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500);
```

You will the result like this:

|id|first_name|last_name|school|hire_date|salary|
|---|---|---|---|---|---|
|1|Janet|Smith|F.D. Roosevelt HS|2011-10-30|36200|
|2|Lee|Reynolds|F.D. Roosevelt HS|1993-05-22|65000|
|3|Samuel|Cole|Myers Middle School|2005-08-01|43500|
|4|Samantha|Bush|Myers Middle School|2011-10-30|36200|
|5|Betty|Diaz|Myers Middle School|2005-08-30|43500|
|6|Kathleen|Roush|F.D. Roosevelt HS|2010-10-22|38500|

### **ALTER**

**ALTER TABLE** changes the structure of a table. For example, you can add or delete columns, create or destroy indexes, change the type of existing columns, or rename columns or the table itself. You can also change characteristics such as the storage engine used for the table or the table comment.

Here we will try several operations on ALTER TABLE command: `RENAME`, `ADD`, and `MODIFY`.

Remember that following the table name, specify the alterations to be made. If none are given, ALTER TABLE does nothing.

- **RENAME**

  Used to change a column name but not its definition.
  ```mysql
  ALTER TABLE table_name RENAME COLUMN column_name TO new_column_name;
  ```
  for example:
  ```mysql
  ALTER TABLE teachers RENAME COLUMN salary TO wage;
  ```

- **ADD & DROP COLUMNS**

  Use **ADD** to add new columns to a table, and **DROP** to remove existing **columns**.
  ```mysql
  ALTER TABLE table_name ADD COLUMN column_name datatype;

  ALTER TABLE table_name DROP COLUMN column_name;
  ```
  example
  ```mysql
  ALTER TABLE teachers ADD COLUMN Age INT;

  ALTER TABLE teachers DROP COLUMN Age;
  ```

- **MODIFY**

  Used to change the data definition/data type of a column in a table, but not it's column name.
  ```mysql
  ALTER TABLE table_name
  MODIFY COLUMN column_name datatype;
  ```
  for example
  ```mysql
  ALTER TABLE teachers
  MODIFY COLUMN hire_date DATE;
  ```
  Now, we have been successfully change data type in hire_date column from VARCHAR(20) to DATE.

### **UPDATE**
**UPDATE** command used for changing the value of certain column(s) in a table. In general, the **UPDATE** syntax are:
```mysql
UPDATE Table_Name SET column1=value1 WHERE <condition>;
```

**For example:**
```mysql
UPDATE teachers
    SET salary=56000
    WHERE teachers.first_name='Samuel';
    
    #or

UPDATE teachers
    SET salary=56000
    WHERE teachers.id=3;   
```

Your table 'teachers' will updated on column salary row 3 from 43500 to 56000.

|id|first_name|last_name|school|hire_date|salary|
|---|---|---|---|---|---|
|1|Janet|Smith|F.D. Roosevelt HS|2011-10-30|36200|
|2|Lee|Reynolds|F.D. Roosevelt HS|1993-05-22|65000|
|3|Samuel|Cole|Myers Middle School|2005-08-01|**56000**|
|4|Samantha|Bush|Myers Middle School|2011-10-30|36200|
|5|Betty|Diaz|Myers Middle School|2005-08-30|43500|
|6|Kathleen|Roush|F.D. Roosevelt HS|2010-10-22|38500|

### **DELETE**
**DELETE** command used for removing certain **row(s)** or the whole entries. In general, the syntax are:
```mysql
DELETE FROM Table_Name; #For removing all rows without deleting the table

    #or
    
DELETE FROM Table_Name WHERE <conditions>; #For removing a certain row
```

**For Example:**
```mysql
DELETE FROM teachers; #For removing all rows without deleting the table

    #or
    
DELETE FROM teachers
       WHERE id=6;    #For removing a certain row
```

The row 6 will be vanished from the table:

|id|first_name|last_name|school|hire_date|salary|
|---|---|---|---|---|---|
|1|Janet|Smith|F.D. Roosevelt HS|2011-10-30|36200|
|2|Lee|Reynolds|F.D. Roosevelt HS|1993-05-22|65000|
|3|Samuel|Cole|Myers Middle School|2005-08-01|56000|
|4|Samantha|Bush|Myers Middle School|2011-10-30|36200|
|5|Betty|Diaz|Myers Middle School|2005-08-30|43500|

### **DROP**
**DROP** command removes one or more existing **table(s)** in database.

```mysql
DROP TABLE table_name;
```
**For Example**
```mysql
DROP TABLE teachers;
```

We can also remove multiple table by listing the table names, like this:
```mysql
DROP TABLE IF EXISTS teachers, marks, students;
```
If any tables named in the argument list do not exist, DROP TABLE behavior depends on whether the **IF EXISTS** clause is given:

- Without IF EXISTS, the statement fails with an error indicating which nonexisting tables it was unable to drop, and no changes are made.

- With IF EXISTS, no error occurs for nonexisting tables. The statement drops all named tables that do exist, and generates a NOTE diagnostic for each nonexistent table.

*Little side note, just in case you are confusing about the difference between `DROP COLUMN`, `DELETE` and `DROP`. Here are some quick tips:*
- *If you want to remove **column** from a table, use `ALTER TABLE ... DROP COLUMN ...;`*
- *If you want to remove certain **row(s)** from a table without deleting the table, use `DELETE FROM ... WHERE ...;`*
- *If you want to remove the **table(s)**, use `DROP TABLE ...;`*

## **DATA WRANGLING**

What is Data Wrangling ?

1. Data wrangling or data munging, is the process of **transforming** and **mapping** data from one "raw" data-source data-form into another format with the intent of making it more appropriate and valuable for a variety of downstream purposes such as analytics.

2. We can simply say that the data wrangling process is a **method of data cleaning and data preparation** by converting it from one form to a more understandable form mainly for preliminary data analytics.

3. The process of transformation such as :
  * Data Exploration
  * Data Preparation
  * Data Cleaning
  * Data Validation 
  * Data Enrichment
  * etc.

4. This might mean modifying all of the values in a given column in a certain way, or merging multiple columns together. 

5. The necessity for data wrangling is often a biproduct of poorly collected or presented data. Data that is entered manually by humans is typically fraught with errors; data collected from websites is often optimized to be displayed on websites, not to be sorted and aggregated.

6. You can think Data Wrangling is like Preprocessing in Machine Learning. But, we are using SQL to cleaning the data rather than using Python.

7. We will also use DDL and DML syntax that we’ve already learn in previous session.

### **DATASET**
**IMPORTANT NOTES :**
1. For this DDL and DML that will explain in this notebook, **it runs smoothly in MySQL**. So, it will be nice if you have MySQL in your computer.

2. **If you don't have MySQL in your computer, you can still follow the instructions with online MySQL. Go to [sqliteonline.com](https://sqliteonline.com/)**. In the left menu, choose MySQL and click `Click to connect`.

3. Sometimes, if you try to run the code with non MySQL, it will error for several reasons. Mainly, this is because different way of writing a particular syntax. For example : for automatically write integer 
  * In MySQL, you must write `AUTO INCREMENT`.
  * In SQLite, you must write `AUTOINCREMENT`.

#### Table `crunchbase_companies_clean_data`

We will use this data for Date Format Wrangling session. Data Definition Language (DDL):
```mysql
CREATE TABLE crunchbase_companies_clean_data (
    permalink VARCHAR(50),
    name VARCHAR(50),
    homepage_url VARCHAR(50),
    category_code VARCHAR(50),
    funding_total_usd BIGINT,
    status VARCHAR(20),
    country_code VARCHAR(5),
    state_code VARCHAR(5),
    region VARCHAR(50),
    city VARCHAR(50),
    funding_rounds INT,
    founded_at VARCHAR(20),
    founded_at_clean VARCHAR(20),
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT
    );
```

Data Manipulation Language (DML) : You can see the data for DML in this [link](https://github.com/ardhiraka/FSDS_Guidelines/blob/master/p1/w2_new/d4am-extra/crunchbase_companies_clean_data.sql).

#### Table `dc_bikeshare_q1_2012`

As for String/Varchar Format Wrangling session, we will use this data. Data Definition Language (DDL):
```mysql
CREATE TABLE dc_bikeshare_q1_2012 (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    duration VARCHAR(20),
    duration_seconds INT,
    start_time DATETIME,
    start_station VARCHAR(70),
    start_terminal INT,
    end_time DATETIME,
    end_station VARCHAR(70),
    end_terminal INT,
    bike_number VARCHAR(10),
    rider_type VARCHAR(20)
    );
```

Data Manipulation Language (DML) : You can see the data for DML in this [link](https://github.com/ardhiraka/FSDS_Guidelines/blob/master/p1/w2_new/d4am-extra/dc_bikeshare_q1_2012.sql).

#### **Data Exploration**

First, you need to know about your dataset. You learned that certain functions work on some data types, but not others.

For example, COUNT works with any data type, but SUM only works for numerical data. In order to use SUM, the data must appear to be numeric, but it must also be stored in the database in a numeric form.

You might run into this problem, for example, if you have a column that appears to be entirely numeric, but happens to contain spaces or commas. If you upload data to particular SQL databases software with commas in a column full of numbers, that SQL database software will treat that column as non-numeric.

Generally, numeric column types in various SQL databases do not support commas or currency symbols. To make things more complicated, SQL databases can store data in many different formats with different levels of precision.

To see a list of data types, you can visit the website of each SQL database software, or at a glance, you can visit [this](https://www.w3schools.com/sql/sql_datatypes.asp).

### **DATE FORMAT**

#### **Converting Datatype**

In our table, you can see in the table `crunchbase_companies_clean_data`, there is a column named `founded_at` and `founded_at_clean`. Let's check the difference between those two with this query : 
```mysql
SELECT `founded_at`, `founded_at_clean`
FROM crunchbase_companies_clean_data;
```
It looks like these two columns contain same information but it have different time format. While `founded_at` uses US date format and `founded_at_clean` uses MySQL default date format.

Let's check further which date format should we use:
```mysql
SELECT `founded_at`, `founded_at_clean`
FROM crunchbase_companies_clean_data
ORDER BY `founded_at`;
```
As you can see, the result is not ordered properly. So we can conclude that it's better to make sure our date/datetime format follows SQL defaults. While we're at it, let's practice to change the `founded_at` date format. 

We can convert data type at the time of querying so that it doesn't change original dataset, using:
```mysql
CONVERT(value, type)
```
or
```mysql
CAST(value AS type)
```
Whops, It seems that `CONVERT(founded_at, DATE)` didn't return the result we expected. Since this function assume the value has SQL default format. So we need another command, we can use STR_TO_DATE to add DATE format information of our value then convert it to DATE format.
```mysql
STR_TO_DATE(founded_at, '%m/%d/%y');
```

You can also apply data type formatting with `ALTER TABLE ... MODIFY COLUMN ...`. This way, your change will be saved and stored in database. Normally we can use:
```mysql
ALTER TABLE crunchbase_companies_clean_data
MODIFY COLUMN founded_at DATE
```
But, since our DATE format is in US Format, you will get error message. To overcome this, we need a little workaround:
```mysql
UPDATE crunchbase_companies_clean_data 
set founded_at = STR_TO_DATE(founded_at, '%m/%d/%y');

ALTER TABLE crunchbase_companies_clean_data
MODIFY founded_at DATE;
```
Now, our founded_at column has SQL DATE format and DATE type.

---
#### ****Deconstruct DATE/DATETIME/TIMESTAMP Format****

You've learned how to construct a date field, but what if you want to deconstruct one? You can use EXTRACT to pull the pieces apart one-by-one:

```mysql
SELECT founded_at,
       EXTRACT(year FROM founded_at) AS year,
       EXTRACT(MONTH FROM founded_at) AS month,
       EXTRACT(DAY FROM founded_at) AS day,
       EXTRACT(QUARTER FROM founded_at) AS quarter
FROM crunchbase_companies_clean_data;
```
You can also use `HOUR`, `MINUTE` and `SECOND` if your data type is DATETIME or TIME.

What if you want to include today's date or time? You can instruct your query to pull the local date and time at the time the query is run using any number of functions. Interestingly, you can run them without a `FROM` clause:

```mysql
SELECT CURRENT_DATE AS date,
       CURRENT_TIME AS time,
       CURRENT_TIMESTAMP AS timestamp,
       LOCALTIME AS local_time,
       LOCALTIMESTAMP AS local_timestamp,
       NOW() AS now
```

As you can see, the different options vary in precision. You might notice that these times probably aren't actually your local time. If you run a current time function against a connected database, you might get a result in a different time zone.

We can also calculate the time interval using `DATE_ADD` or `DATE_DIFF`. You just need to make sure the value/variable used in this function is in `DATE`, `DATETIME` or `TIMESTAMP` type.
```mysql
SELECT founded_at,
       CURRENT_DATE AS local_time,
	   DATEDIFF(CURRENT_DATE, founded_at) AS founded_time_ago,
       DATE_ADD(founded_at, INTERVAL 10 DAY) AS plus_10_days
FROM crunchbase_companies_clean_data;
```

There is a lot function related to Date & Time. This is example those functions in [MySQL](https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html/).

---
#### **Handling Missing Value**

Before we are moving into our next dataset, we can see that founded_at column has several missing value. we can handle these with `COALESCE`. It will impute the missing value with value we put into the function:
```mysql
SELECT founded_at, COALESCE(founded_at, 'No Date')
FROM crunchbase_companies_clean_data;
```

### **STRING FORMAT**

#### **LEFT, RIGHT, SUBSTR**
You can use `LEFT` to pull a certain number of characters from the left side of a string and present them as a separate string. The syntax is `LEFT(string, number of characters)`.

`RIGHT` does the same thing, but from the right side.

While `LEFT` and `RIGHT` both create substrings of a specified length, but they only do so starting from the sides of an existing string. If you want to start in the middle of a string, you can use `SUBSTR`. The syntax is `SUBSTR(*string*, *starting character position*, *# of characters*)`

As a practical example, we can see that the date field in this dataset begins with a 10-digit date, and include the timestamp to the right of it. We can pull either date, timestamp or minute using this query.

```mysql
SELECT start_time,
	LEFT(start_time, 10) as selected_date,
    RIGHT(start_time, 8) as selected_time,
    SUBSTR(start_time, 15, 2) AS selected_minute
from dc_bikeshare_q1_2012;
```
The `LENGTH` function returns the length of a string. So `LENGTH(date)` will always return 19 in this dataset. Since we know that the first 10 characters will be the date, and they will be followed by a space (total 11 characters), we could represent the `RIGHT` function like this:

```mysql
SELECT start_time,
       RIGHT(start_time, LENGTH(start_time) - 11) as selected_time,
from dc_bikeshare_q1_2012;
```
When using functions within other functions, it's important to remember that **the innermost functions will be evaluated first, followed by the functions that encapsulate them**.

#### **TRIM**
The `TRIM` function is used to remove characters from the beginning and end of a string. Here's an example:
```mysql
SELECT bike_number,
	   TRIM(leading 'W0' FROM bike_number) AS trimmed
from dc_bikeshare_q1_2012;
```
The `TRIM` function takes 3 arguments. First, you have to specify whether you want to remove characters from the beginning ('leading'), the end ('trailing'), or both ('both'). Next you must specify all characters to be trimmed. Any characters included in the single quotes will be removed from both beginning, end, or both sides of the string. Finally, you must specify the text you want to trim using `FROM`.

#### **POSITION**
`POSITION` allows you to specify a substring, then returns a numerical value equal to the character number (counting from left) where that substring first appears in the target string. For example, the following query will return the position of the character 'A' (case-sensitive) where it first appears in the `descript` field:
```mysql
SELECT bike_number,
       POSITION('1' in bike_number) as pos
FROM dc_bikeshare_q1_2012;
```

#### **UPPER AND LOWER**
Sometimes, you just don't want your data to look like it's screaming at you. 
* You can use **`LOWER` to force every character in a string to become lower-case**. 
* Similarly, you can use **`UPPER` to make all the letters appear in upper-case**:

```mysql
SELECT start_station,
    LOWER(start_station) AS lowered,
    UPPER(start_station) AS uppered
FROM dc_bikeshare_q1_2012;
```

#### **CONCAT**
You can combine strings from several columns together (and with hard-coded values) using `CONCAT`. Simply order the values you want to concatenate and separate them with commas. If you want to hard-code values, enclose them in single quotes. Here's an example:
```mysql
SELECT start_station,
	   start_terminal,
       CONCAT(start_terminal, " - ", start_station) AS station_id_name
FROM dc_bikeshare_q1_2012;
```